#Область ПрограммныйИнтерфейс 

// Обработать исходящий запрос.
Процедура ОбработатьИсходящийЗапрос() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК Текст,
	|	ВКМ_УведомленияТелеграмБоту.Ссылка,
	|	ВКМ_ТокенУправленияТелеграмБотом.Значение КАК TokenTG,
	|	ВКМ_ИдентификаторГруппыДляОповещения.Значение КАК Chat_id
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту,
	|	Константа.ВКМ_ТокенУправленияТелеграмБотом КАК ВКМ_ТокенУправленияТелеграмБотом,
	|	Константа.ВКМ_ИдентификаторГруппыДляОповещения КАК ВКМ_ИдентификаторГруппыДляОповещения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		TokenTG = Выборка.TokenTG;
		Chat_id = Выборка.Chat_id;
		Текст = Выборка.Текст;
		
		ИмяСервера = "api.telegram.org";
		Соединение = Новый HTTPСоединение(ИмяСервера,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		Данные = Новый Структура;
		Данные.Вставить("text", Текст);
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		АдресРесурса = "bot" + TokenTG + "/sendMessage?chat_id=" + Формат(Chat_id, "ЧГ=");
		Запрос = Новый HTTPЗапрос(АдресРесурса);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Попытка
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		Исключение
			ЗаписьЖурналаРегистрации("Выполнение операции", УровеньЖурналаРегистрации.Ошибка,,, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Если Ответ.КодСостояния = 200 Тогда
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Удалить();
		Иначе
			ВызватьИсключение "Ошибка проверки связи";
		КонецЕсли;
		
		Возврат;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

 
